workr-web/app/controllers/users/omniauth_callbacks_controller.rb

  def twitter
    uid = request.env['omniauth.auth']["uid"]
    user = User.find_for_authentication(uid: uid, provider: "twitter")
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = '331051994' AND `users`.`provider` = 'twitter' LIMIT 1