workr-web/app/controllers/api/v1/articles_controller.rb

      def index
        load_associations = [:user, :collections, :content_source, :tags]
        preload_article = Article.includes(load_associations)
        articles = if params["ids"]
          preload_article.where(["id in (?)", params["ids"]])
        elsif params["collection_id"]
          Collection.find(params["collection_id"]).articles.includes(load_associations)
---
SELECT `articles`.* FROM `articles` WHERE (id in ('1'))
SELECT `articles`.* FROM `articles` INNER JOIN `articles_collections` ON `articles`.`id` = `articles_collections`.`article_id` WHERE `articles_collections`.`collection_id` = 1
SELECT `collections`.*, `t0`.`article_id` AS ar_association_key_name FROM `collections` INNER JOIN `articles_collections` `t0` ON `collections`.`id` = `t0`.`collection_id` WHERE `t0`.`article_id` IN (1)

      def create
        content_source = ContentSource.find(params["article"]["content_source_id"])
        article = ArticleManager.create_from_content_source(content_source, article_params.merge(user_id: current_user.id, collection_ids: params["article"]["collection"]))
---
SELECT `content_sources`.* FROM `content_sources` WHERE `content_sources`.`id` = 1 LIMIT 1
INSERT INTO `articles` (`content_source_id`, `created_at`, `description`, `title`, `type`, `updated_at`, `user_id`) VALUES (1, '2013-11-01 10:45:49', 'sunspot - Solr-powered search for Ruby objects', 'sunspot', 'ImageArticle', '2013-11-01 10:45:49', 3)

      def find_article
        @article = Article.find(params["id"])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` IN (1) AND `articles`.`type` IN ('HtmlArticle')