workr-web/app/controllers/api/v1/collections_controller.rb

      def index
        collection_includes = Collection.includes(:user)
        collections = if !params["ids"].nil?
          collection_includes.where(["id in (?)", params["ids"]])
        elsif params["user_id"]
          collection_includes.where(user_id: params["user_id"])
        else
          collection_includes.limit(100)
---
SELECT `collections`.* FROM `collections` WHERE `collections`.`user_id` = 3
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `collections`.* FROM `collections` LIMIT 100

      def create
        collection = Collection.new(collection_params.merge(user: current_user))
        if collection.save
---
INSERT INTO `collections` (`created_at`, `description`, `name`, `updated_at`, `user_id`) VALUES ('2014-01-29 12:22:37', 'test 1 desc', 'test 1', '2014-01-29 12:22:37', 1)

      def find_collection
        @collection = Collection.find(params["id"])
---
SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 1 LIMIT 1