workr-web/app/controllers/api/v1/content_sources_controller.rb

      def show
        content_source = ContentSource.find(params["id"])
---
SELECT `content_sources`.* FROM `content_sources` WHERE `content_sources`.`id` = 1 LIMIT 1