workr-web/app/controllers/api/v1/feeds_controller.rb

      def index
        keywords = params[:query].present? ? [params[:query]] : current_user.interests.map(&:name)
---
SELECT `interests`.* FROM `interests` INNER JOIN `interests_users` ON `interests`.`id` = `interests_users`.`interest_id` WHERE `interests_users`.`user_id` = 3