workr-web/app/controllers/api/v1/ratings_controller.rb

      def create
        RatingsManager.create_or_update(article_id: rating_params()[:article], user_id: current_user.id, rating: rating_params()[:rating])
---
INSERT INTO `ratings` (`article_id`, `user_id`) VALUES (2, 3)

      def show
        rating = Rating.find(params[:id])
---
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`id` = 1 LIMIT 1