workr-web/app/controllers/api/v1/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
---
      def find_user
        @user = User.find(params["id"])