workr-web/app/controllers/api/v1/viewed_articles_controller.rb

      def create
        viewed_article = current_user.viewed_articles.create!(article_id: viewed_article_params()[:article])
---
INSERT INTO `viewed_articles` (`article_id`, `user_id`) VALUES (1, 3)

      def index
        render json: current_user.viewed_articles.limit(5), each_serializer: ViewedArticleSerializer
---
SELECT `viewed_articles`.* FROM `viewed_articles` WHERE `viewed_articles`.`user_id` = 3 LIMIT 5